In [2]:
import pandas as pd

In [3]:
data4 = pd.read_excel(r"C:\Users\user\Downloads\mydata4.xlsx")

In [4]:
data4

    Name  Age  Salay
0  Pinky   30  20000
1   john   22  15000
2   neha   25  30000
3    raj   26  35000

In [5]:
data2 = pd.read_csv("E:\docment\mydata2.csv")

In [6]:
data2

   Roll No     Name  Batch
0     1001    Pinky   1840
1     1002     John   1043
2     1003   Deepak   1840
3     1004  Anjuman   1765

In [26]:
data3 = pd.read_csv("E:\docment\Mydata3.tsv",sep='\t')

In [25]:
data3

   RollNO    Name  Batch
0    1001   pinky   1804
1    1002    John   1873
2    1003  Deppak   1840
3    1004     raj   1540

In [27]:
data3

   RollNO    Name  Batch
0    1001   pinky   1804
1    1002    John   1873
2    1003  Deppak   1840
3    1004     raj   1540